Monard2033/nRF52840-Transmitter/src/main - Copy (PWM,ADC-OK).c
/*
 * Copyright (c) 2024 Monard2033
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/kernel.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/pm/pm.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/state.h>
#include <zephyr/pm/policy.h>
#include <zephyr/logging/log.h>
#include <zephyr/device.h>
#include <esb.h>
#include <zephyr/sys_clock.h>
#include <string.h>
#include <nrfx.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/drivers/pwm.h>
#include <zephyr/usb/usb_device.h>
#include <zephyr/usb/class/usb_hid.h>

LOG_MODULE_REGISTER(transmitter, LOG_LEVEL_INF);
enum led_color
{
    LED_RED,
    LED_GREEN,
    LED_BLUE,
    LED_YELLOW,
    LED_ORANGE,
    LED_WHITE,
    LED_OFF
};

// Packet types
enum packet_type {
    PACKET_TYPE_BIND_REQUEST = 0x01,
    PACKET_TYPE_BIND_ACK = 0x04,
    PACKET_TYPE_BATTERY_VOLTAGE = 0x06
};

void sample_and_transmit(struct esb_evt const *event);
void enter_low_power(struct k_timer *dummy);
void update_sleep_timeout(void);
void led_timer_handler(struct k_timer *timer);
int check_battery_status(void);
void send_battery_level(uint32_t voltage);
void battery_warning_timer_handler(struct k_timer *timer);
void battery_check_timer_handler(struct k_timer *timer);
void battery_pulse_timer_handler(struct k_timer *timer);
static void charging_pulse_timer_handler(struct k_timer *timer);
void post_init_callback(struct k_timer *timer);
K_TIMER_DEFINE(post_init_timer, post_init_callback, NULL);
static bool initialization_complete = false;
static void usb_status_cb(enum usb_dc_status_code status, const uint8_t *param);
static const struct device *hid_dev;

/* --- LED and Timer Definitions --- */
static K_TIMER_DEFINE(pulse_timer, NULL, NULL); // Timer for pulsing
static volatile bool pulsing = false;
static enum led_color pulse_color = LED_OFF;
static uint8_t pulse_step = 0;
static const uint8_t max_steps = 20; // Number of fade steps
static const uint32_t step_delay = 50; // 50ms per step for smooth fade

/* --- Pin Definitions from Device Tree --- */
/* static const struct pwm_dt_spec data_plus = GPIO_DT_SPEC_GET(DT_N_NODELABEL_data_plus_pin,gpios);
static const struct gpio_dt_spec data_minus = GPIO_DT_SPEC_GET(DT_N_NODELABEL_data_minus_pin,gpios); */
static const struct adc_dt_spec adc = ADC_DT_SPEC_GET(DT_PATH(adc_input));

/* --- LED Definitions --- */
static const struct pwm_dt_spec pwm_red = PWM_DT_SPEC_GET(DT_ALIAS(red_pwm_led));
static const struct pwm_dt_spec pwm_green = PWM_DT_SPEC_GET(DT_ALIAS(green_pwm_led));
static const struct pwm_dt_spec pwm_blue = PWM_DT_SPEC_GET(DT_ALIAS(blue_pwm_led));


/* void set_led_status(enum led_color color) {
    switch (color) {
        case LED_RED:
            gpio_pin_set_dt(&red_led, 1);
            gpio_pin_set_dt(&green_led, 0);
            gpio_pin_set_dt(&blue_led, 0);
            break;
        case LED_GREEN:
            gpio_pin_set_dt(&red_led, 0);
            gpio_pin_set_dt(&green_led, 1);
            gpio_pin_set_dt(&blue_led, 0);
            break;
        case LED_BLUE:
            gpio_pin_set_dt(&red_led, 0);
            gpio_pin_set_dt(&green_led, 0);
            gpio_pin_set_dt(&blue_led, 1);
            break;
        case LED_YELLOW:
            gpio_pin_set_dt(&red_led, 1);
            gpio_pin_set_dt(&green_led, 1);
            gpio_pin_set_dt(&blue_led, 0);
            break;
        case LED_ORANGE:
            gpio_pin_set_dt(&red_led, 1);
            gpio_pin_set_dt(&green_led, 1); // Simplified orange as Red + Green
            gpio_pin_set_dt(&blue_led, 0);
            break;
        case LED_OFF:
            gpio_pin_set_dt(&red_led, 0);
            gpio_pin_set_dt(&green_led, 0);
            gpio_pin_set_dt(&blue_led, 0);
            break;
        default:
            // Handle unexpected enum values by turning off all LEDs
            gpio_pin_set_dt(&red_led, 0);
            gpio_pin_set_dt(&green_led, 0);
            gpio_pin_set_dt(&blue_led, 0);
            break;
    }
} */


static K_TIMER_DEFINE(led_timer, led_timer_handler, NULL);
static K_TIMER_DEFINE(inactivity_timer, NULL, enter_low_power);
static K_TIMER_DEFINE(battery_warning_timer, battery_warning_timer_handler, NULL);
static K_TIMER_DEFINE(battery_pulse_timer, battery_pulse_timer_handler, NULL);
static K_TIMER_DEFINE(charging_pulse_timer, charging_pulse_timer_handler, NULL);
static K_TIMER_DEFINE(battery_check_timer, battery_check_timer_handler, NULL);

/* --- ESB and Power Management --- */
static struct esb_payload tx_payload;
static struct esb_config esb_config = ESB_DEFAULT_CONFIG;
#define ERROR_PAYLOAD_FLAG 0x80

/* --- USB HID Configuration --- */
static K_SEM_DEFINE(usb_configured_sem, 0, 1);
static volatile bool usb_configured = false;
#define REPORT_ID 1
#define KEY_CTRL_CODE_MIN 224
#define KEY_CTRL_CODE_MAX 231
#define KEY_CODE_MIN 0
#define KEY_CODE_MAX 101
#define KEY_PRESS_MAX 6
#define INPUT_REPORT_KEYS_MAX_LEN (1 + 1 + KEY_PRESS_MAX)

/* --- Hysteresis Sleep Configuration --- */
#define BASE_TIMEOUT K_SECONDS(60)
#define GRACE_PERIOD_MS 2000
static k_timeout_t current_timeout = BASE_TIMEOUT;
static int wakeup_count = 0;
static int64_t last_sleep_time = 0;

/* --- Battery Configuration --- */
#define BATTERY_CRITICAL_THRESHOLD 15
#define BATTERY_MAX_VOLTAGE 4200
#define BATTERY_MIN_VOLTAGE 3430
#define CHARGING_THRESHOLD_DELTA 50
#define FULL_CHARGE_THRESHOLD 4190
static bool battery_warning_active = false;
static uint32_t pulse_count = 0;
static uint32_t battery_level = 0;
static int64_t last_voltage_time = 0;
static uint32_t last_voltage_mv = 0;
static uint32_t max_voltage_mv = 0;
static bool is_charging = false;

/* HID Report Descriptor for a standard keyboard */
static const uint8_t hid_report_desc[] = {
    0x05, 0x01, 0x09, 0x06, 0xA1, 0x01, 0x75, 0x01,
    0x95, 0x08, 0x05, 0x07, 0x19, 0xE0, 0x29, 0xE7,
    0x15, 0x00, 0x25, 0x01, 0x81, 0x02, 0x95, 0x01,
    0x75, 0x08, 0x81, 0x01, 0x95, 0x06, 0x75, 0x08,
    0x15, 0x00, 0x25, 0x65, 0x05, 0x07, 0x19, 0x00,
    0x29, 0x65, 0x81, 0x00, 0xC0
};

struct usb_desc_strings {
const uint8_t *product;
};

/* --- INIT PERIPHERALS --- */
void init_peripherals(void)
{
   
