Monard2033/nRF52840-Transmitter/src/main - Copy (PWM,ADC-OK).c
        int err = adc_channel_setup_dt(&adc);
        if (err < 0) {
            LOG_ERR("ADC channel setup failed (ID: %u, err: %d)", adc.channel_id, err);
            return 0;
        }
        err = adc_sequence_init_dt(&adc, &sequence);
        if (err < 0) {
            LOG_ERR("ADC sequence init failed (channel ID: %u, resolution: %u, err: %d)",
                    adc.channel_id, sequence.resolution, err);
            return 0;
        }
        err = adc_read(adc.dev, &sequence);
        if (err < 0) {
            LOG_ERR("ADC read failed (channel ID: %u, buffer size: %u, err: %d)",
                    adc.channel_id, sequence.buffer_size, err);
            return 0;
        }

    uint32_t adc_value = buf;
    LOG_INF("ADC READ VALUE: %d", adc_value);
    uint32_t voltage_mv = (adc_value * 1.45);
    LOG_INF("VOLTAGE mV: %d mV", voltage_mv);
    battery_level = (voltage_mv - BATTERY_MIN_VOLTAGE) * 100 / (BATTERY_MAX_VOLTAGE - BATTERY_MIN_VOLTAGE);
    if (battery_level < 0) battery_level = 0;
    if (battery_level > 100) battery_level = 100;

    LOG_INF("Battery level: %d%%, Voltage: %d mV", battery_level, voltage_mv);

        // Set LED color based on battery level
    if (battery_level >= 75 && battery_level <= 100) {
        battery_led_color = LED_GREEN;
    } else if (battery_level >= 50 && battery_level < 75) {
        battery_led_color = LED_YELLOW;
    } else if (battery_level >= 25 && battery_level < 50) {
        battery_led_color = LED_ORANGE;
    } else if (battery_level >= 0 && battery_level < 25) {
        battery_led_color = LED_RED;
    } else {
        battery_led_color = LED_OFF; // Or a warning color like LED_ORANGE
    }
    set_led_status(battery_led_color);

    /// First 5 seconds override logic
    if (k_uptime_get() < Z_TIMEOUT_MS_TICKS(5000)) {
        LOG_INF("System just started, setting battery LED color based on level %d%%", battery_level);
        set_led_status(battery_led_color); // Use the determined color
        k_timer_start(&led_timer, K_SECONDS(5), K_NO_WAIT);
        //blink_led(LED_WHITE , 500,5); // Turn off after 5 seconds
    }

    // Detect charging or full battery
    int64_t now_ms = k_uptime_get();
    if (now_ms - last_voltage_time >= 1000) {
        if (last_voltage_mv > 0) {
            if ((voltage_mv - last_voltage_mv) > CHARGING_THRESHOLD_DELTA) {
                is_charging = true;
                k_timer_start(&charging_pulse_timer, K_MSEC(500), K_NO_WAIT);
                battery_warning_active = false;
                k_timer_stop(&battery_warning_timer);
                k_timer_stop(&battery_pulse_timer);
                LOG_INF("Charging detected, starting green led");
            } else if (is_charging && voltage_mv >= FULL_CHARGE_THRESHOLD) {
                k_timer_stop(&charging_pulse_timer);
                set_led_status(LED_GREEN);
                max_voltage_mv = voltage_mv;
                LOG_INF("Full charge reached, static green");
            }
        }
        last_voltage_time = now_ms;
        last_voltage_mv = voltage_mv;
        if (voltage_mv > max_voltage_mv) {
            max_voltage_mv = voltage_mv;
        }
    }

    // Low battery alert
    if (battery_level < BATTERY_CRITICAL_THRESHOLD && !is_charging && !battery_warning_active) {
        battery_warning_active = true;
        k_timer_start(&battery_warning_timer, K_NO_WAIT, K_NO_WAIT);
    }

    // Send via ESB
    //send_battery_level(voltage_mv);
    return voltage_mv;
}
void battery_check_timer_handler(struct k_timer *dummy) {
   check_battery_status();
}

static void usb_status_cb(enum usb_dc_status_code status, const uint8_t *param)
{
    ARG_UNUSED(param);
    switch (status)
    {
    case USB_DC_CONFIGURED:
        LOG_INF("USB_DC_CONFIGURED received, setting usb_configured = true");
        usb_configured = true;
        k_sem_give(&usb_configured_sem);
        break;
    case USB_DC_DISCONNECTED:
        LOG_INF("USB_DC_DISCONNECTED received, setting usb_configured = false");
        usb_configured = false;
        break;
    default:
        break;
    }
}
void send_battery_level(uint32_t voltage) {
// Prepare 8-byte payload
    // Prepare 8-byte payload with packet type 0x06 for battery voltage
    uint8_t payload_data[8] = {0x06}; // Packet type 0x06 for voltage
    memcpy(payload_data + 1, &voltage, sizeof(voltage)); // Offset by 1 byte for packet type

    // Set payload length and copy to tx_payload
    tx_payload.length = sizeof(payload_data);
    memcpy(tx_payload.data, payload_data, sizeof(payload_data));

    // Send via ESB
    int err = esb_write_payload(&tx_payload);
    if (err == 0) {
        LOG_INF("TX -> Voltage: %d mV", voltage);
        pulse_led(LED_GREEN, 200, 2); // Replace blink
    } else {
        pulse_led(LED_RED, 300, 3); // Replace blink
    }
    set_led_status(LED_OFF);
}
void sample_and_transmit(struct esb_evt const *event) {
    static uint8_t last_payload_data[2] = {0};
    uint8_t payload_data[2] = {0}; // Example test payload
    if (payload_data[0] != last_payload_data[0] || payload_data[1] != last_payload_data[1]) {
        tx_payload.length = sizeof(payload_data);
        memcpy(tx_payload.data, payload_data, sizeof(payload_data));
        last_payload_data[0] = payload_data[0];
        last_payload_data[1] = payload_data[1];
        if (esb_write_payload(&tx_payload) == 0) {
            LOG_INF("TX -> D+: %d, D-: %d", payload_data[0], payload_data[1]);
        } else {
            LOG_ERR("ESB write payload failed");
        }
    }
}

void send_windows_key(void) {
    uint8_t hid_report[8] = {0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}; // Left GUI only
    tx_payload.length = 8;
    memcpy(tx_payload.data, hid_report, 8);
    if (esb_write_payload(&tx_payload) == 0) {
        LOG_INF("TX -> Windows key press sent");
        blink_led(LED_GREEN, 200, 3);
    } else {
        LOG_ERR("Failed to send Windows key press, ESB error");
    }

    k_sleep(K_MSEC(100)); // Delay to ensure key is registered
    memset(hid_report, 0, 8); // Clear all bytes for key release
    tx_payload.length = 8;
    memcpy(tx_payload.data, hid_report, 8);
    if (esb_write_payload(&tx_payload) == 0) {
        LOG_INF("TX -> Windows key release sent");
    } else {
        LOG_ERR("Failed to send Windows key release, ESB error");
    }
}

void post_init_callback(struct k_timer *timer)
{
    if (!initialization_complete) {
        LOG_WRN("Post-init attempted before peripherals ready. Retrying...");
        k_timer_start(&post_init_timer, K_MSEC(100), K_NO_WAIT);
        return;
    }

