Monard2033/nRF52840-Transmitter/src/main - Copy (PWM,ADC-OK).c
}
int main(void)
{
    int err;
    LOG_INF("Starting 2.4GHz HID Keyboard Transmitter");
    
    hid_dev = device_get_binding("HID_0");
    LOG_INF("USB device found and ready.");

    usb_hid_register_device(hid_dev, hid_report_desc, sizeof(hid_report_desc), NULL);
    LOG_INF("HID registered.");

    err = usb_hid_init(hid_dev);
    if (err)
    {
        LOG_ERR("Failed to init USB HID, err %d", err);
        return 0;
    }
    LOG_INF("HID initialized.");

    LOG_INF("Attempting to enable USB...");
    if (IS_ENABLED(CONFIG_USB_DEVICE_STACK))
    {
        err = usb_enable(NULL);
        if (err)
        {
            LOG_ERR("Failed to enable USB, err %d", err);
            return 0;
        }
        LOG_INF("USB enabled successfully.");
    }
   
    esb_config.protocol = ESB_PROTOCOL_ESB_DPL;
    esb_config.mode = ESB_MODE_PTX;
    esb_config.bitrate = ESB_BITRATE_2MBPS;
    esb_config.payload_length = 8;
    esb_config.retransmit_count = 5;
    esb_config.retransmit_delay = 100;
    esb_config.tx_output_power = ESB_TX_POWER_6DBM;
    esb_config.event_handler = sample_and_transmit;
    err = esb_init(&esb_config);
    if (err)
    {LOG_ERR("ESB initialization failed, err %d", err);}
    uint8_t base_addr_0[4] = {0xAB, 0x12, 0xCD, 0x34};
    err = esb_set_base_address_0(base_addr_0);
    if (err)
    {LOG_ERR("Failed to set base address 0");}
    uint8_t prefixes[8] = {0xA1, 0xA2, 0xA3, 0xA4, 0xA5, 0xA6, 0xA7, 0xA8};
    err = esb_set_prefixes(prefixes, 8);
    if (err)
    {LOG_ERR("Failed to set prefixes");}
    LOG_INF("Transmitter initialized successfully");

    /* // Initialize GPIOs 
    if (!device_is_ready(data_plus.port) || !device_is_ready(data_minus.port))
    {LOG_ERR("Data GPIOs not ready");}
    else {LOG_INF("Data GPIOs ready: D+ pin %d, D- pin %d", data_plus.pin, data_minus.pin);}

    gpio_pin_configure_dt(&data_plus, GPIO_INPUT);
    gpio_pin_configure_dt(&data_minus, GPIO_INPUT | GPIO_PULL_UP);

    * //Initialize RGB LED 
    if (!device_is_ready(red_led.port) || !device_is_ready(green_led.port) || !device_is_ready(blue_led.port))
    {LOG_ERR("RGB LED GPIOs not ready");}
    else { LOG_INF("RGB LED GPIOs ready: Red pin %d, Green pin %d, Blue pin P1.0%d", red_led.pin, green_led.pin, blue_led.pin);}

    gpio_pin_configure_dt(&red_led, GPIO_OUTPUT);
    gpio_pin_configure_dt(&green_led, GPIO_OUTPUT);
    gpio_pin_configure_dt(&blue_led, GPIO_OUTPUT);
 */
    if (!device_is_ready(pwm_red.dev)) {
        LOG_ERR("PWM device not ready");
        blink_led(LED_RED, 100, 5); // Fallback using GPIO if defined
    }
    LOG_INF("PWM initialized for RGB LEDs: P0.22 (Red), P0.24 (Green), P1.00 (Blue)");
    //k_timer_start(&led_timer, K_SECONDS(5), K_NO_WAIT);
    /* Configure GPIO Interrupt for Wake-up */
    static struct gpio_callback pin_cb_data;
    //gpio_init_callback(&pin_cb_data, pin_activity_handler, BIT(data_plus.pin) | BIT(data_minus.pin));
    /* err = gpio_add_callback(data_plus.port, &pin_cb_data);
    if (err)
    {LOG_ERR("Failed to add callback, err %d", err);} */

 /*    gpio_pin_interrupt_configure_dt(&data_plus, GPIO_INT_EDGE_BOTH);
    gpio_pin_interrupt_configure_dt(&data_minus, GPIO_INT_EDGE_BOTH); */

    if (!esb_is_idle()) {
        LOG_WRN("ESB not idle, flushing buffers");
        esb_flush_tx();
        esb_flush_rx();
    }
    err = esb_start_tx();
    if (err)
    {LOG_ERR("ESB start_tx failed: %d", err);}
    LOG_INF("ESB started, waiting for data...");
    LOG_INF("Blinking blue LED to indicate ESB connect attempt...");
    //blink_led(LED_BLUE, 250, 3);

    check_battery_status();
    set_led_status(LED_WHITE);
    //for(int i = 0; i < 20; i++) {check_battery_status(); k_sleep(K_SECONDS(1));}
    //k_timer_start(&battery_check_timer, K_MINUTES(1), K_MINUTES(1));

    /* Send Windows key sequence (for testing) */
    //send_windows_key();
    //k_sleep(K_MSEC(200)); // Delay to ensure key is registered
    //LOG_INF("Windows key sequence sent");

    return 0;
}